# 1. Import Pandas

In [1]:
import pandas as pd

---
# 2. Import the Titanic dataset (titanic.csv) and show its 15 first rows

In [2]:
ttn = pd.read_csv('../datasets/titanic.csv')
ttn.head(15)

,PassengerId,Survival,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S

---
# 3. Calculate the average (mean) age of the passengers

In [3]:
ttn.loc[:, 'Age'].mean()

np.float64(29.69911764705882)

---
# 4. Print the maximum Fare paid by a passenger

In [4]:
ttn['Fare'].max()

np.float64(512.3292)

---
# 5. Create a new column called `%Fare` following the next steps

We want to calculate the percentage of the total fare, that was paid by each passenger. To do that:
* __Step 1.__ Calculate the sum of the `Fare` column
* __Step 2.__ Divide the `Fare` column with the value from __step 1__, and multiply it by __100__
* __Step 3.__ Store the result in a new column

__Note:__ You are free to choose whether to perform all the steps in 1 line of code, or spread it out in several lines

In [6]:
ttn['Fare'].sum()

np.float64(28693.9493)

In [22]:
ttn.loc[:, '%Fare'] = ttn['Fare'] / ttn['Fare'].sum() * 100

In [23]:
ttn

,Name,Sex,Age,Survival,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,%Fare
PassengerId,,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,0,3,1,0,A/5 21171,7.2500,NaN,S,0.025267
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,1,0,PC 17599,71.2833,C85,C,0.248426
3,"Heikkinen, Miss. Laina",female,26.0,1,3,0,0,STON/O2. 3101282,7.9250,NaN,S,0.027619
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,1,0,113803,53.1000,C123,S,0.185056
5,"Allen, Mr. William Henry",male,35.0,0,3,0,0,373450,8.0500,NaN,S,0.028055
...,...,...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",male,27.0,0,2,0,0,211536,13.0000,NaN,S,0.045306
888,"Graham, Miss. Margaret Edith",female,19.0,1,1,0,0,112053,30.0000,B42,S,0.104552
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0,3,1,2,W./C. 6607,23.4500,NaN,S,0.081725
890,"Behr, Mr. Karl Howell",male,26.0,1,1,0,0,111369,30.0000,C148,C,0.104552
891,"Dooley, Mr. Patrick",male,32.0,0,3,0,0,370376,7.7500,NaN,Q,0.027009

### 5.1 Validate that your resulted calculations are right

Perform the operations manually for 1 sample, just to be sure your approach was correct.

In [9]:
7.25 / 28693.9493 * 100

0.025266650903296883

---
# 6. Set the `PassengerId` column as an Index to the DataFrame
__Note:__ Make sure to propagete the change into the dataframe.

In [10]:
ttn.set_index('PassengerId', inplace=True)

### 6.1 Print the Index of the DataFrame

In [12]:
ttn.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
      dtype='int64', name='PassengerId', length=891)

---
# 7. Move the `Name`, `Sex` and `Age` columns at the beginning
The new column order should be: `Name, Sex, Age, Survival, Pclass, SibSp, Parch, Ticket, Fare, Cabin, Embarked`

__Note:__ Make sure to propagete the change into the dataframe.

In [14]:
ttn = ttn[["Name", "Sex", "Age", "Survival", "Pclass", "SibSp", "Parch", "Ticket", "Fare", "Cabin", "Embarked"]]

---
# 8. Reset the DataFrame Index to the original one

In [16]:
ttn.reset_index()

,PassengerId,Name,Sex,Age,Survival,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,1,0,A/5 21171,7.2500,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,1,0,113803,53.1000,C123,S
4,5,"Allen, Mr. William Henry",male,35.0,0,3,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0,2,0,0,211536,13.0000,NaN,S
887,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,0,0,112053,30.0000,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0,3,1,2,W./C. 6607,23.4500,NaN,S
889,890,"Behr, Mr. Karl Howell",male,26.0,1,1,0,0,111369,30.0000,C148,C
890,891,"Dooley, Mr. Patrick",male,32.0,0,3,0,0,370376,7.7500,NaN,Q

---
# 9. Delete the `%Fare` column

In [26]:
ttn.drop(columns=['%Fare'], inplace=True)

In [27]:
ttn

,Name,Sex,Age,Survival,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,0,3,1,0,A/5 21171,7.2500,NaN,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,1,0,PC 17599,71.2833,C85,C
3,"Heikkinen, Miss. Laina",female,26.0,1,3,0,0,STON/O2. 3101282,7.9250,NaN,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,1,0,113803,53.1000,C123,S
5,"Allen, Mr. William Henry",male,35.0,0,3,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",male,27.0,0,2,0,0,211536,13.0000,NaN,S
888,"Graham, Miss. Margaret Edith",female,19.0,1,1,0,0,112053,30.0000,B42,S
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0,3,1,2,W./C. 6607,23.4500,NaN,S
890,"Behr, Mr. Karl Howell",male,26.0,1,1,0,0,111369,30.0000,C148,C
891,"Dooley, Mr. Patrick",male,32.0,0,3,0,0,370376,7.7500,NaN,Q